; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v4 ?v3)
             (pred_2 ?v6 ?v1)
             (pred_8 ?v4 ?v1)
             (pred_11 ?v11 ?v4 )
	     (pred_12 ?v4)
             (pred_7 ?v2)
             (pred_6 ?v6)
             (pred_4 ?v1)
             (pred_3 ?v4)
             (pred_10 ?v6)
             (pred_1 ?v4)
             (pred_5 ))



(:action op_3
:parameters (?v5 ?v7 ?v8 ?v12)
:precondition (and (pred_7 ?v5) (pred_7 ?v7) (pred_6 ?v8) (pred_4 ?v12)
          (pred_9 ?v5 ?v7) (pred_2 ?v8 ?v12)
                   (pred_8 ?v7 ?v12) (pred_12 ?v5) 
                   (pred_3 ?v7) (pred_10 ?v8))
:effect (and  (pred_1 ?v7) (not (pred_3 ?v7))))


(:action op_1
:parameters (?v5 ?v13)
:precondition (and (pred_7 ?v5) (pred_7 ?v13)
               (pred_12 ?v5) (pred_9 ?v5 ?v13) (pred_1 ?v13))
:effect (and (pred_12 ?v13) (not (pred_12 ?v5))))

(:action op_5
:parameters (?v5 ?v8)
:precondition (and (pred_7 ?v5) (pred_6 ?v8) 
                  (pred_12 ?v5) (pred_11 ?v8 ?v5) (pred_5 ))
:effect (and (pred_10 ?v8)
   (not (pred_11 ?v8 ?v5)) (not (pred_5 ))))


(:action op_4
:parameters (?v5 ?v9 ?v10)
:precondition (and (pred_7 ?v5) (pred_6 ?v9) (pred_6 ?v10)
                  (pred_12 ?v5) (pred_10 ?v10) (pred_11 ?v9 ?v5))
:effect (and (pred_10 ?v9) (pred_11 ?v10 ?v5)
        (not (pred_10 ?v10)) (not (pred_11 ?v9 ?v5))))

(:action op_2
:parameters (?v5 ?v8)
:precondition (and (pred_7 ?v5) (pred_6 ?v8) 
                  (pred_12 ?v5) (pred_10 ?v8))
:effect (and (pred_5 ) (pred_11 ?v8 ?v5) (not (pred_10 ?v8)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_18 obj_11 obj_16 obj_14 obj_02 obj_01 obj_09 obj_22 obj_17 obj_12 obj_13 obj_04 obj_07 obj_15 obj_19
    obj_08 obj_03 obj_05
    obj_20 obj_21 obj_10
    )

    (:init
       (pred_5)

       (pred_7 obj_06)
       (pred_7 obj_18)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_14)
       (pred_7 obj_02)
       (pred_7 obj_01)
       (pred_7 obj_09)
       (pred_7 obj_22)
       (pred_7 obj_17)
       (pred_7 obj_12)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_15)
       (pred_7 obj_19)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_05)
       (pred_6 obj_20)
       (pred_6 obj_21)
       (pred_6 obj_10)

       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_11)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_18)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_14)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_09)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_01)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_17)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_22)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_19 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_8  obj_14 obj_08)
       (pred_8  obj_22 obj_03)
       (pred_8  obj_09 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_18)
       (pred_1 obj_11)
       (pred_1 obj_16)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_19)

       (pred_2  obj_20 obj_08)
       (pred_2  obj_21 obj_03)
       (pred_2  obj_10 obj_05)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_10 obj_04)
       (pred_12 obj_11)
    )

    (:goal (and
       (pred_11 obj_21 obj_18)
    ))
(:constraints
  (always (not (pred_12 obj_12)))
)
)

; plan
1. (op_1 obj_11 obj_18)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_02)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_17)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_17)
   goals met: 0 of 1
4. (op_1 obj_17 obj_07)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_15)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_15)
   goals met: 0 of 1
6. (op_5 obj_15 obj_21)
   deleted: (pred_11 obj_21 obj_15) (pred_5)
   added: (pred_10 obj_21)
   goals met: 0 of 1
7. (op_1 obj_15 obj_07)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_07)
   goals met: 0 of 1
8. (op_1 obj_07 obj_17)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_17)
   goals met: 0 of 1
9. (op_1 obj_17 obj_02)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_02)
   goals met: 0 of 1
10. (op_1 obj_02 obj_18)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_18)
   goals met: 0 of 1
11. (op_2 obj_18 obj_21)
   deleted: (pred_10 obj_21)
   added: (pred_5) (pred_11 obj_21 obj_18)
   goals met: 1 of 1
